export const storeProducts = [
  {
  "id": "000000100",
  "name": "Бетонна суміш Р4",
  "description": "",
  "price": "",
  "groupName": "Продукция",
  "isGroup": true,
  "params": {
  "": ""
  }
  },
  {
  "id": "000000101",
  "name": "Бетонна суміш Р3",
  "description": "",
  "price": "",
  "groupName": "Продукция",
  "isGroup": true,
  "params": {
  "": ""
  }
  },
  {
  "id": "000000105",
  "name": "Бетонна суміш Р1",
  "description": "",
  "price": "",
  "groupName": "Продукция",
  "isGroup": true,
  "params": {
  "": ""
  }
  },
  {
  "id": "000000006",
  "name": "Бетонна суміш В-20 (М-250) Р-3",
  "description": "Використовується при виготовленні монолітних фундаментів, обмосток, парканів, стін, площадок,сходів.",
  "price": "1700",
  "groupName": "Бетонна суміш Р3",
  "isGroup": false,
  "params": {
  "Клас": "В-20",
  "Рухливість": "Р-3",
  "Марка": "М-250",
  "Морозостійкість": "F75",
  "Водонепроникність": "W4"
  }
  },
  {
  "id": "000000016",
  "name": "Бетонна суміш В-20 (М-250) Р-4",
  "description": "",
  "price": "1835",
  "groupName": "Бетонна суміш Р4",
  "isGroup": false,
  "params": {
  "Клас": "В-20",
  "Рухливість": "Р-4",
  "Марка": "М-250",
  "Морозостійкість": "F75",
  "Водонепроникність": "W4"
  }
  },
  {
  "id": "000000017",
  "name": "Бетонна суміш В-7,5 (М-100) Р-3",
  "description": "Дрібнозерниста бетонна суміш, застовується під час попередніх робіт по монтажу фундаменту.",
  "price": "1510",
  "groupName": "Бетонна суміш Р3",
  "isGroup": false,
  "params": {
  "Клас": "В-7,5",
  "Рухливість": "Р-3",
  "Марка": "М-100",
  "Морозостійкість": "F50"
  }
  },
  {
  "id": "000000018",
  "name": "Бетонна суміш В-10 (М-150) Р-3",
  "description": "Дрібнозерниста бетонна суміш, застосовується в тонкостінних конструкціях для заповнення стиків між елементами, формування гідроізоляційного шару. ",
  "price": "1550",
  "groupName": "Бетонна суміш Р3",
  "isGroup": false,
  "imageGuid": "cd7bc6d5-07f5-11ec-89df-a85e453db88d",
  "params": {
  "Клас": "В-10",
  "Рухливість": "Р-3",
  "Марка": "М-150",
  "Морозостійкість": "F50"
  }
  }
]

export const goodsForTest = [
    {
        "id": "000000013",
        "name": "Пісок будівельний",
        "description": "Піски́ будіве́льні (рос. пески строительные, англ. construction sands, quarry sands, mason's sands, mortar sands, нім. Sande m pl für Bauzwecke) — найбільша функціональна група пісків, що використовуються для всіх видів бетонів і будівельних розчинів, а також для облаштування доріг та інших будівельних робіт. \n"
            + "Будівельний пісок - згідно ГОСТ 8736-2014 будівельний пісок - це неорганічний сипучий матеріал з крупністю зерен до 5 мм, що утворився в результаті природного руйнування скельних гірських порід і отримується при розробці піщаних і піщано-гравійних родовищ без використання або з використанням спеціального збагачувального обладнання.\n"
            + "Піски будівельні поділяють на природні (природні і збагачені) і штучні, що отримують спеціальним дробленням скельних гірських порід. До природних відносять піски крупністю 0,05-5 мм.\n"
            + "Якість будівельних пісків характеризується їх ґранулометричним (зерновим) складом, вмістом пилувато-глинистих частинок, органічних і шкідливих домішок; середньою густиною зерен піску; вологістю.\n"
            + "За крупністю зерен природні будівельні піски поділяються на групи: крупні, середні, дрібні і дуже дрібні.\n"
            + "Шкідливі домішки мінералів і порід (гіпс, пірит, слюда та інші), а також органічних речовин, як правило, обмежуються або не допускаються.\n"
            + "Серед родовищ пісків за генезисом виділяються алювіальні, льодовикові, морські, озерні, елювіальні, делювіальні, пролювіальні і еолові.\n"
            + "Пісок підрозділяється на: природний і збагачений з відсівів дроблення. Пісок з відсівів дроблення характеризується межею міцності вихідної гірської породи при стиску в водонасиченому стані.",
        "price": "123",
        "groupName": "Товар для сайту",
        "isGroup": false,
        "params": {
            "": ""
        }
    },
    {
        "id": "000000158",
        "name": "Щебінь фр.5*20",
        "description": "",
        "price": "1657",
        "groupName": "Товар для сайту",
        "isGroup": false,
        "params": {
            "": ""
        }
    }
]

export const servicesForTest = [
    {
        "id": "000000140",
        "name": "Послуги автобетононасоса",
        "description": "Автобетононасос – це бетононасос, поставлений на шасі тягача. Дані бетононасоси призначені для експлуатації на тих будівельних майданчиках, де ускладнений під'їзд до об'єкта.\n Головна відмінність автобетононасоса від стаціонарного – його мобільність і наявність стріли. Він без проблем може пересуватися по будівництву або ж обслужити кілька будівельних майданчиків, при цьому подаючи бетон в будь-яку точку обслуговування. Продуктивність 90 м³ / год.",
        "price": "150",
        "groupName": "Послуги для сайту",
        "isGroup": false,
        "params": {
            "": ""
        }
    },
    {
        "id": "000000161",
        "name": "Подача бетону транспортерною стрічкою",
        "description": "",
        "price": "150",
        "groupName": "Послуги для сайту",
        "isGroup": false,
        "params": {
            "": ""
        }
    }
]



export const detailProduct = {
  id: 1,
  name: "Бетонна суміш В20 (М-250) Р-3",
  price: 1200,
  img: "img/beton2.jpg",
  description: "Бетон М-250, В-20, Р-3, F-200, W-6, СМ практичний матеріал, який часто використовується в сучасному будівництві. Продукція годиться для заливки фундаменту монолітних будівель, для прокладання дорожнього полотна. Відносно ціни, то вона цілком співвідносна з якістю.",
  inCart: false,
  quantity: 0,
    params: {},
}


export const defaultUser = {
  id: 0,
  firstName: "",
  lastName: "",
  loggedIn: false,
  props: {
    email: "",
    phone: "",
  }
}
